1.moving contact/HLLC/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    side1
    {
        type            totalPressure;
        rho             rho;
        psi             thermo:psi;
        gamma           1;
        p0              uniform 100000;
        value           uniform 100000;
    }
    side2
    {
        type            totalPressure;
        rho             rho;
        psi             thermo:psi;
        gamma           1.4;
        p0              uniform 100000;
        value           uniform 100000;
    }
    empty1
    {
        type            empty;
    }
    empty2
    {
        type            empty;
    }
}


// ************************************************************************* //
