1.moving contact/HLLC/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue T 298
    volScalarFieldValue p 1e+5
    volVectorFieldValue U ( 10 0 0 )
    volScalarFieldValue Y.Liq 1
    volScalarFieldValue C0 1
);

regions
(
    boxToCell
    {
        box ( 5 -1 -1 ) ( 10  1  1 );
        fieldValues
        (
            volScalarFieldValue Y.Liq 0
            volScalarFieldValue C0 0
            
        );
    }
);


// ************************************************************************* //
